In [ ]:
# List of high schools
high_schools = ["Hernandez High School", "Figueroa High School",
                "Wilson High School","Wright High School"]

In [ ]:
for school in high_schools:
    print(school)

In [ ]:
# A dictionary of high schools and the type of school.
high_school_types = [{"High School": "Griffin", "Type":"District"},
                    {"High School": "Figueroa", "Type": "District"},
                    {"High School": "Wilson", "Type": "Charter"},
                    {"High School": "Wright", "Type": "Charter"}]
for high_schools in high_school_types:
    print(high_schools)

In [ ]:
# List of high schools
high_schools = ["Huang High School", "Figueroa High School", "Shelton High School", "Hernandez High School",
                "Griffin High School","Wilson High School", "Cabrera High School", "Bailey High School", 
                "Holden High School", "Pena High School", "Wright High School","Rodriguez High School", 
                "Johnson High School", "Ford High School", "Thomas High School"]

In [19]:
# Dependencies
import pandas as pd

In [ ]:
# Create a Pandas Series from a list.
school_series = pd.Series(high_schools)
school_series

In [ ]:
p_s = school_series.iloc[1]
print("Using Iloc: " + p_s)

In [ ]:
# A dictionary of high schools
high_school_dicts = [{"School ID": 0, "school_name": "Huang High School", "type": "District"},
                    {"School ID": 1, "school_name": "Figueroa High School", "type": "District"},
                    {"School ID": 2, "school_name":"Shelton High School", "type": "Charter"},
                    {"School ID": 3, "school_name":"Hernandez High School", "type": "District"},
                    {"School ID": 4, "school_name":"Griffin High School", "type": "Charter"}]

In [ ]:
# make a data frame
school_df = pd.DataFrame(high_school_dicts)
school_df

In [ ]:
# Three separate lists of information on high schools
school_id = [0, 1, 2, 3, 4]

school_name = ["Huang High School", "Figueroa High School",
"Shelton High School", "Hernandez High School","Griffin High School"]

type_of_school = ["District", "District", "Charter", "District","Charter"]

In [ ]:
# Initialize a new DataFrame.
schools_df = pd.DataFrame()

In [ ]:
# Add the list to a new DataFrame.
schools_df["School ID"] = school_id
schools_df["School Name"] = school_name
schools_df["Type of School"] = type_of_school

# Print the DataFrame.
schools_df

In [ ]:
# Create a dictionary of information on high schools.
high_schools_dict = {'School ID': school_id, 'school_name':school_name, 'type':type_of_school}

In [ ]:
# make a data frame
h_school_df = pd.DataFrame(high_schools_dict)
h_school_df

In [ ]:
school_df.columns

In [ ]:
school_df.index

In [ ]:
school_df.values

In [ ]:
# Three separate lists of information on high schools
school_id = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14]

school_name = ["Huang High School", "Figueroa High School","Shelton High School", "Hernandez High School", 
               "Griffin High School", "Wilsoin High School", "Cabrera High School", 
               "Bailey High School", "Holden High School", "Pena High School", "Wright High School", 
               "Rodriguez High School", "Johnson High School", "Ford High School", "Thomas High School"]

type_of_school = ["District", "District", "Charter", "District","Charter", "Charter", "Charter", "District","Charter", 
                  "Charter", "Charter", "District", "District", "District", "Charter"]

In [ ]:
# Initialize a new DataFrame.
my_schools_df = pd.DataFrame()

In [ ]:
# Add the list to a new DataFrame.
my_schools_df["School ID"] = school_id
my_schools_df["School Name"] = school_name
my_schools_df["Type of School"] = type_of_school

# Print the DataFrame.
my_schools_df

In [ ]:
my_schools_df.index

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
apple_df = pd.DataFrame({"AAPL": [72.27, np.nan, 74.39, np.nan, 75.94, 76.93,np.nan, 78.74, np.nan, 
                                  79.81, np.nan, 79.53, np.nan, 79.56, 79.49]})

apple_df

In [ ]:
apple_df.isnull()

In [ ]:
apple_df.isnull().sum()

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
daily_returns = pd.DataFrame({
    "AAPL": [0.5, np.nan, 0.62],
    "GOOG": [0.45, 0.63, 0.55]
})
daily_returns

In [ ]:
#Fill the missing data point with the average of that column
daily_returns = daily_returns.fillna(daily_returns.mean())
daily_returns

In [ ]:
## drop the missing data row 
# daily_returns.dropna()
## Replace the NaNs with "Unknown"
# daily_returns = daily_returns.fillna("Unknown")
## Replace the NaNs with 0
# daily_returns = daily_returns.fillna(0)

In [ ]:
import pandas as pd
best_actors_df = pd.DataFrame({
    "Best Actors": ["Nic Cage", "Nic Cage", "Harrison Ford"]
})
best_actors_df

In [ ]:
best_actors_df.isnull().count()

In [ ]:
unique = best_actors_df["Best Actors"].unique()
unique

In [ ]:
best_actors_df.duplicated()

In [ ]:
best_actors_df.duplicated().sum()

In [ ]:
best_actors_df = best_actors_df.drop_duplicates()
best_actors_df

In [1]:
import pandas as pd

In [2]:
prices = pd.DataFrame({
    "price_usd": ["$0.53", "$0.22", "0.34"]
})

prices

  price_usd
0     $0.53
1     $0.22
2      0.34

In [3]:
prices.dtypes

price_usd    object
dtype: object

In [4]:
prices.loc[:, "price_usd"] = prices.loc[:, "price_usd"].str.replace("$", "")
prices

/var/folders/8_/84ygstjn04l_cb9w4k46lflc0000gn/T/ipykernel_26806/1582289591.py:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  prices.loc[:, "price_usd"] = prices.loc[:, "price_usd"].str.replace("$", "")

  price_usd
0      0.53
1      0.22
2      0.34

In [5]:
prices.dtypes

price_usd    object
dtype: object

In [6]:
prices.loc[:, "price_usd"] = prices.loc[:, "price_usd"].astype("float")

In [7]:
prices.dtypes

price_usd    float64
dtype: object

In [8]:
prices.describe()

       price_usd
count   3.000000
mean    0.363333
std     0.156312
min     0.220000
25%     0.280000
50%     0.340000
75%     0.435000
max     0.530000

In [9]:
sales_df = pd.DataFrame({"item": ["tomatoes", "onions", "potatoes", "tomatoes", "mushrooms"],
                "quantity": [15, 26, 10, 12, 2],
                "total_price": [50.25, 39.52, 50.01, 40.20, 8.46]})
sales_df.head()

        item  quantity  total_price
0   tomatoes        15        50.25
1     onions        26        39.52
2   potatoes        10        50.01
3   tomatoes        12        40.20
4  mushrooms         2         8.46

In [10]:
sales_df.describe()

        quantity  total_price
count   5.000000     5.000000
mean   13.000000    37.688000
std     8.717798    17.128761
min     2.000000     8.460000
25%    10.000000    39.520000
50%    12.000000    40.200000
75%    15.000000    50.010000
max    26.000000    50.250000

In [12]:
 sales_df.describe(include='all')

            item   quantity  total_price
count          5   5.000000     5.000000
unique         4        NaN          NaN
top     tomatoes        NaN          NaN
freq           2        NaN          NaN
mean         NaN  13.000000    37.688000
std          NaN   8.717798    17.128761
min          NaN   2.000000     8.460000
25%          NaN  10.000000    39.520000
50%          NaN  12.000000    40.200000
75%          NaN  15.000000    50.010000
max          NaN  26.000000    50.250000

In [15]:
sales_df.mean()

/var/folders/8_/84ygstjn04l_cb9w4k46lflc0000gn/T/ipykernel_26806/2906524947.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  sales_df.mean()

quantity       13.000
total_price    37.688
dtype: float64

In [16]:
min_price = sales_df["total_price"].min()
min_price

8.46

In [13]:
import pandas as pd

goog_df = pd.DataFrame({"AAPL": [1045.85, 1070.08, 1140.99, 1113.65, 1193.32, 1231.54, 1215.00, 1207.15,1248.84, 
                                 1166.27, 1138.85, 1003.63, 1080.91]})

goog_df

       AAPL
0   1045.85
1   1070.08
2   1140.99
3   1113.65
4   1193.32
5   1231.54
6   1215.00
7   1207.15
8   1248.84
9   1166.27
10  1138.85
11  1003.63
12  1080.91

In [14]:
goog_df.describe(include='all')

              AAPL
count    13.000000
mean   1142.775385
std      76.556568
min    1003.630000
25%    1080.910000
50%    1140.990000
75%    1207.150000
max    1248.840000

In [20]:
sales_df = pd.DataFrame({
    "item": ["tomatoes", "onions", "potatoes", "tomatoes", "mushrooms", "potatoes", "onions", "tomatoes", "onions", "tomatoes"],
    "store": ["Downtown", "Downtown", "Midtown", "Midtown", "Downtown", "Midtown", "Downtown", "Midtown", "Midtown", "Midtown"],
    "quantity": [15, 26, 10, 12, 2, 3, 17, 16, 20, 9],
    "total_price": [50.25, 39.52, 50.10, 40.20, 8.46, 15.03, 25.84, 53.60, 30.40, 30.15]})
sales_df

        item     store  quantity  total_price
0   tomatoes  Downtown        15        50.25
1     onions  Downtown        26        39.52
2   potatoes   Midtown        10        50.10
3   tomatoes   Midtown        12        40.20
4  mushrooms  Downtown         2         8.46
5   potatoes   Midtown         3        15.03
6     onions  Downtown        17        25.84
7   tomatoes   Midtown        16        53.60
8     onions   Midtown        20        30.40
9   tomatoes   Midtown         9        30.15

In [23]:
item_group_df = sales_df.groupby("item")
item_group_df.mean()

           quantity  total_price
item
mushrooms       2.0        8.460
onions         21.0       31.920
potatoes        6.5       32.565
tomatoes       13.0       43.550

In [24]:
store_item_group_df = sales_df.groupby(["store", "item"])
store_item_group_df.max()

                    quantity  total_price
store    item
Downtown mushrooms         2         8.46
         onions           26        39.52
         tomatoes         15        50.25
Midtown  onions           20        30.40
         potatoes         10        50.10
         tomatoes         16        53.60